# DuctFittingAndAccessoryPressureDropUIData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropUIData Properties
DuctFittingAndAccessoryPressureDropUIData Class See Also
---
The DuctFittingAndAccessoryPressureDropUIData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DuctFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Mechanical Namespace